# Rebar Get Overridable Crank Parameters Method

Source: https://www.revitapidocs.com/2026/40b68944-5e0d-7777-da95-1516ade00d76.htm

---

| Rebar Get Overridable Crank Parameters Method |
| --- |

Gets the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarCrankOverridableParameters GetOverridableCrankParameters()
```

```
Public Function GetOverridableCrankParameters As RebarCrankOverridableParameters
```

```
public:
RebarCrankOverridableParameters^ GetOverridableCrankParameters()
```

```
member GetOverridableCrankParameters : unit -> RebarCrankOverridableParameters
```

#### Return Value

RebarCrankOverridableParameters
Returns the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters. See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace